app/controllers/sales_controller.rb

  def create
    document = params[:sale][:file].read.force_encoding('UTF-8')
    document = document.split("\n")
    document.shift
    @data = []
    document.each {|i| @data.push(i.split("\t")) }
---
INSERT INTO "sales" ("customer", "description", "price", "quantity", "address", "supplier", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)